MrBlinky/Arduboy-homemade-package/board-package-source/boards.txt
arduboy-homemade.menu.display.128x128=SSD1327/29 (128x128)
arduboy-homemade.menu.display.128x128.build.display=-128x128
arduboy-homemade.menu.display.128x128.usb_product_postfix=128128
arduboy-homemade.menu.display.128x128.bootloader_display=-ssd132x-128x128
arduboy-homemade.menu.display.128x128.build.extra_flags=-DARDUBOY_10 -DOLED_128X128 {build.flash_cs} {build.contrast} {build.usb_flags}

arduboy-homemade.menu.display.st7565=LCD ST7565 (backlit)
arduboy-homemade.menu.display.st7565.build.display=-st7565
arduboy-homemade.menu.display.st7565.usb_product_postfix=lcd
arduboy-homemade.menu.display.st7565.bootloader_display=-st7565
arduboy-homemade.menu.display.st7565.build.extra_flags=-DARDUBOY_10 -DLCD_ST7565 {build.flash_cs} {build.contrast} {build.usb_flags}

arduboy-homemade.menu.display.gu12864_800b=GU12864-800B
arduboy-homemade.menu.display.gu12864_800b.build.display=-gu12864
arduboy-homemade.menu.display.gu12864_800b.usb_product_postfix=vfd
arduboy-homemade.menu.display.gu12864_800b.bootloader_display=-gu12864
arduboy-homemade.menu.display.gu12864_800b.build.extra_flags=-DARDUBOY_10 -DGU12864_800B {build.flash_cs} {build.contrast} {build.usb_flags}

# External flash chip select pin #

arduboy-homemade.menu.flashselect.sda=Pin2/D1/SDA (official)
arduboy-homemade.menu.flashselect.sda.build.flash_cs=-DCART_CS_SDA
arduboy-homemade.menu.flashselect.sda.build.flashselect=-sda
arduboy-homemade.menu.flashselect.sda.bootloader_flashselect=-sda

arduboy-homemade.menu.flashselect.rx=Pin0/D2/Rx (original)
arduboy-homemade.menu.flashselect.rx.build.flash_cs=-DCART_CS_RX
arduboy-homemade.menu.flashselect.rx.build.flashselect=
arduboy-homemade.menu.flashselect.rx.bootloader_flashselect=

# Display contrast adjustment #

arduboy-homemade.menu.contrast.normal=Normal
arduboy-homemade.menu.contrast.normal.build.contrast=

arduboy-homemade.menu.contrast.dimmed=Dimmed
arduboy-homemade.menu.contrast.dimmed.build.contrast=-DOLED_CONTRAST=0x7F

arduboy-homemade.menu.contrast.low=Low
arduboy-homemade.menu.contrast.low.build.contrast=-DOLED_CONTRAST=0x2F

arduboy-homemade.menu.contrast.lowest=Lowest
arduboy-homemade.menu.contrast.lowest.build.contrast=-DOLED_CONTRAST=0x00

arduboy-homemade.menu.contrast.highest=Highest
arduboy-homemade.menu.contrast.highest.build.contrast=-DOLED_CONTRAST=0xFF

################################################################################
# Arduboy board
################################################################################

arduboy.name=Arduboy (FX)

#Arduino Leonardo
arduboy.vid.0=0x2341
arduboy.pid.0=0x0036
arduboy.vid.1=0x2341
arduboy.pid.1=0x8036
arduboy.vid.2=0x2A03
arduboy.pid.2=0x0036
arduboy.vid.3=0x2A03
arduboy.pid.3=0x8036
#Arduino Micro
arduboy.vid.4=0x2341
arduboy.pid.4=0x0037
arduboy.vid.5=0x2341
arduboy.pid.5=0x8037
arduboy.vid.6=0x2A03
arduboy.pid.6=0x0037
arduboy.vid.7=0x2A03
arduboy.pid.7=0x8037
#Genuino Micro
arduboy.vid.8=0x2341
arduboy.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy.vid.8=0x1b4f
arduboy.pid.8=0x9205
arduboy.vid.9=0x1b4f
arduboy.pid.9=0x9206

arduboy.upload.tool=arduino:avrdude
arduboy.upload.protocol=avr109
arduboy.upload.maximum_size=28672
arduboy.upload.maximum_data_size=2560
arduboy.upload.speed=57600
arduboy.upload.disable_flushing=true
arduboy.upload.use_1200bps_touch=true
arduboy.upload.wait_for_upload_port=true

arduboy.bootloader.tool=arduino:avrdude
arduboy.bootloader.low_fuses=0xff
arduboy.bootloader.high_fuses=0xd0
arduboy.bootloader.extended_fuses=0xcb
arduboy.bootloader.file=caterina/Caterina-Leonardo.hex
arduboy.bootloader.unlock_bits=0x3F
arduboy.bootloader.lock_bits=0x2F

arduboy.build.mcu=atmega32u4
arduboy.build.f_cpu=16000000L
arduboy.build.variant=arduboy
arduboy.build.board=AVR_ARDUBOY
arduboy.build.vid=0x2341
arduboy.build.pid=0x8036
arduboy.build.variant=arduboy
arduboy.build.usb_product="Arduboy"
arduboy.build.board=AVR_ARDUBOY
arduboy.build.core=arduino:arduino
arduboy.build.flash_cs=-DCART_CS_SDA
arduboy.build.extra_flags=-DARDUBOY_10 {build.flash_cs} {build.usb_flags}

# Arduboy menu options #########################################################

arduboy.menu.core.arduboy-core=Arduboy optimized core
arduboy.menu.core.arduboy-core.build.core=arduboy

arduboy.menu.core.arduino-core=Standard Arduino core
arduboy.menu.core.arduino-core.build.core=arduino:arduino

arduboy.menu.boot.org=original (Caterina)
arduboy.menu.boot.org.upload.maximum_size=28672
arduboy.menu.boot.org.bootloader.high_fuses=0xd0
arduboy.menu.boot.org.bootloader.file=caterina/Caterina-Leonardo.hex
                 
arduboy.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy.menu.boot.cathy3k.upload.maximum_size=29696
arduboy.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy.menu.boot.cathy3k.bootloader.file=cathy3k/arduboy3k-bootloader-menu-sda.hex

arduboy.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy.menu.boot.cathy3kg.bootloader.file=cathy3k/arduboy3k-bootloader-game-sda.hex

################################################################################
# Arduboy DevKit board
################################################################################

arduboy-devkit.name=Arduboy DevKit

#Arduino Leonardo
arduboy-devkit.vid.0=0x2341
arduboy-devkit.pid.0=0x0036
arduboy-devkit.vid.1=0x2341
arduboy-devkit.pid.1=0x8036
arduboy-devkit.vid.2=0x2A03
arduboy-devkit.pid.2=0x0036
arduboy-devkit.vid.3=0x2A03
arduboy-devkit.pid.3=0x8036
#Arduino Micro
arduboy-devkit.vid.4=0x2341
arduboy-devkit.pid.4=0x0037
arduboy-devkit.vid.5=0x2341
arduboy-devkit.pid.5=0x8037
arduboy-devkit.vid.6=0x2A03
arduboy-devkit.pid.6=0x0037
arduboy-devkit.vid.7=0x2A03
arduboy-devkit.pid.7=0x8037
#Genuino Micro
arduboy-devkit.vid.8=0x2341
arduboy-devkit.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-devkit.vid.7=0x1b4f
arduboy-devkit.pid.7=0x9205
arduboy-devkit.vid.8=0x1b4f
arduboy-devkit.pid.8=0x9206

arduboy-devkit.upload.tool=arduino:avrdude
arduboy-devkit.upload.protocol=avr109
arduboy-devkit.upload.maximum_size=28672
arduboy-devkit.upload.maximum_data_size=2560
arduboy-devkit.upload.speed=57600
arduboy-devkit.upload.disable_flushing=true
arduboy-devkit.upload.use_1200bps_touch=true
arduboy-devkit.upload.wait_for_upload_port=true

